## Plan Result (client-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/246735)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 2 to destroy.</code></pre>

* Delete
  * aws_cloudwatch_log_group.aws-otel-collector-log-group
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.aws-otel-collector-log-group will be destroyed
  # (because aws_cloudwatch_log_group.aws-otel-collector-log-group is not in configuration)
  - resource "aws_cloudwatch_log_group" "aws-otel-collector-log-group" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/Backend/ClientAPI-Prod/ecs/aws-otel-collector" -> null
      - id                = "/Backend/ClientAPI-Prod/ecs/aws-otel-collector" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/Backend/ClientAPI-Prod/ecs/aws-otel-collector" -> null
      - retention_in_days = 90 -> null
      - skip_destroy      = true -> null
      - tags              = {
          - "app_code"       = "pocket-content-shared"
          - "component_code" = "pocket-content-shared-clientapi"
          - "costCenter"     = "Shared"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "ClientAPI"
        } -> null
      - tags_all          = {
          - "app_code"       = "pocket-content-shared"
          - "component_code" = "pocket-content-shared-clientapi"
          - "costCenter"     = "Shared"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "ClientAPI"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod:404" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
                {
                    cpu                    = 0
                    environment            = [
                        {
                            name  = "APOLLO_GRAPH_REF"
                            value = "pocket-client-api@current"
                        },
                        {
                            name  = "APP_ENVIRONMENT"
                            value = "production"
                        },
                        {
                            name  = "OTLP_COLLECTOR_HOST"
                            value = "localhost"
                        },
                        {
                            name  = "PORT"
                            value = "4001"
                        },
                        {
                            name  = "REDIS_ENDPOINT"
                            value = "clientapi-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                    ]
                    essential              = true
                    healthCheck            = {
                        command     = [
                            "CMD-SHELL",
                            "curl -f http://localhost:4001/.well-known/apollo/server-health || exit 1",
                        ]
                        interval    = 15
                        retries     = 3
                        startPeriod = 0
                        timeout     = 5
                    }
                    image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/clientapi-prod-app:latest"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group             = "/Backend/ClientAPI-Prod/ecs/app"
                            awslogs-multiline-pattern = "^\\S.+"
                            awslogs-region            = "us-east-1"
                            awslogs-stream-prefix     = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "app"
                    portMappings           = [
                        {
                            containerPort = 4001
                            hostPort      = 4001
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "APOLLO_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ClientAPI/Prod/APOLLO_KEY"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ClientAPI/Prod/SENTRY_DSN"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
              - {
                  - command                = [
                      - "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-otel-collector"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/ClientAPI-Prod/ecs/aws-otel-collector"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "aws-otel-collector"
                  - portMappings           = [
                      - {
                          - containerPort = 4138
                          - hostPort      = 4138
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4137
                          - hostPort      = 4137
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "ClientAPI-Prod" -> (known after apply)
      ~ revision                 = 404 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket-content-shared"
            "component_code" = "pocket-content-shared-clientapi"
            "costCenter"     = "Shared"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "ClientAPI"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod:404" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"9138c1f8-827e-44e3-bfae-f49dad2d21c6","JobName":"client-api_infrastructure_plan_prod","PRNumber":675,"Program":"tfcmt","SHA1":"43abfa663c90642dd0745cde44ee02d4f29fd3f4","Target":"client-api-cdk","Vars":{}} -->